/* Дефинирайте едномерен масив int с 10 елемента =
{100,90,80,70,60,50,40,30,20,10} Дефинирайте пойнтер, който ще сочи към
масива.
Достъпете 3 тия елемент от масива и му задайте стойност 5.
Достъпете 4 тия елемент и му задайте стойност 33.
Достъпете 5 тия елемент и го намалете със 7.
Достъпете 7 мия елемент и го увеличете с 10.
Достъпете 10 тия елемент и го умножете по 3.
Изпишете го по двата възможни начина и закоментирайте единя.
Принтирайте на екрана всички елементи на масива. */
#include <stdio.h>

int main(void){
    int array[10] = {100,90,80,70,60,50,40,30,20,10};
    int *pArray = NULL;

    /* array[2] = 5;
    array[3] = 33;
    array[4] -= 7;
    array[6] += 10;
    array[9] *= 3; */

    pArray = array;
    pArray[2] = 5;
    pArray[3] = 33;
    pArray[4] -= 7;
    pArray[6] += 10;
    pArray[9] *= 3;

    int i;
    for (i = 0; i < 10; i++)
        printf("%d ", array[i]);

    return 0;
}