/* Напишете функцията int linSearch(int a[], int l, int d),
която получава като първи аргумент началото на масив а, втория
аргумент е дължината на масива, а третия аргумент е числото,
което търсим. Претърсете масива елемент по елемент и ако
някой елемент съвпада с търсеното число върнете позицията на
която се намира този елемент. В противен случай върнете – 1. */
#include <stdio.h>
int linSearch(int a[], int l, int d);

int main(void){
    int array[] = {9, 19, 29, 39, 49, 59, 69, 79, 89, 99};
    printf("%d\n", linSearch(array, 10, 59));
    return 0;
}

int linSearch(int a[], int l, int d){
    int i, c;
    for (i = 0; i < 10; i++)
        if (a[i] == d)    
            return i;
    return -1;
}