/* Как работи? Дефинираме променлива “а“, дефинираме пойнтер,
но още не му задаваме стойност. Отпечатайте адреса на “а”.
След това присвояваме стойност на пойнтера, като внимаваме
типовете на пойнтера и променливата да са от един и същи тип.
Отпечатваме на екрана стойността на пойнтера с %р, стойността
на „а“ с %d, стойността на *ptr с %d. */
#include <stdio.h>

int main(void){
    int a = 5;
    int *ip;
    printf("a address: %p\n", &a);
    ip = &a;
    printf("ip value: %p\na value: %d\n*ip value: %d\n", ip, a, *ip);

    return 0;
}
