/* Дефинирайте и инициализирайте int променлива = 34 и
пойнтер към нея.
Опитайте да ги разместите, като поредност (първо да е
пойнтерът, после променливата).

Можете ли да умножите пойнтер по пойнтер? - Не. Може да умножим стойностите
на променливите, към които сочат. Не може да умножим адрес по адрес.

При тази декларация колко пойнтера имаме:
int *p, k; - Един *р. */
#include <stdio.h>

int main(void){
    int a = 34;
    int *ipa = &a;
    printf("*ipa address: %p\t*ipa value:%i\n", ipa, *ipa);

    int *ipb;
    int b = 43;
    ipb = &b;

    printf("*ipb address: %p\t*ipb value:%i\n", ipb, *ipb);

    return 0;
}